In [1]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
}

In [2]:
import pandas as pd
data= pd.DataFrame(data)

In [3]:
data

   ages  heights
0    14      165
1    18      180
2    24      176
3    42      184

In [ ]:
We can specify a custom index, when creating the DataFrame:

In [8]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
}

In [9]:
data= pd.DataFrame(data, index=['Rukaiya','RIfaza','Rukki','Anas'])

In [10]:
data

         ages  heights
Rukaiya    14      165
RIfaza     18      180
Rukki      24      176
Anas       42      184

In [13]:
print('The row that corresponds to the index "Bob"',data.loc['RIfaza'])

The row that corresponds to the index "Bob" ages        18
heights    180
Name: RIfaza, dtype: int64

In [ ]:
Indexing


We can select a single column by specifying its name in square brackets:

In [14]:
data['ages']

Rukaiya    14
RIfaza     18
Rukki      24
Anas       42
Name: ages, dtype: int64

In [ ]:
this is a series

In [ ]:
If we want to select multiple columns, we can specify a list of column names:

In [15]:
data= data[['ages','heights']]

In [16]:
data

         ages  heights
Rukaiya    14      165
RIfaza     18      180
Rukki      24      176
Anas       42      184

In [ ]:
This time, the result is a DataFrame, as it includes multiple columns.

In [ ]:
Slicing

In [17]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
}

In [18]:
import pandas as pd
df= pd.DataFrame(data)

In [19]:
df =df.iloc[:3]
df

   ages  heights
0    14      165
1    18      180
2    24      176

In [20]:
df=df.iloc[2]

In [21]:
df

ages        24
heights    176
Name: 2, dtype: int64

In [ ]:
to get the last 2 record

In [22]:
import pandas as pd
data= pd.DataFrame(data)
df=data.iloc[-2:]
df

   ages  heights
2    24      176
3    42      184

In [ ]:
Conditions

In [25]:
df= data[(data['ages']>15)&(data['heights']<180)]

In [26]:
df

   ages  heights
2    24      176

In [ ]:

Reading Data from file

In [ ]:
df = pd.read_csv("ca-covid.csv")

In [ ]:
The read_csv() function reads the data of a CSV file into a DataFrame:

In [ ]:
Reading Data

In [27]:
df=data.head(4)

In [28]:
df

   ages  heights
0    14      165
1    18      180
2    24      176
3    42      184

In [ ]:
The info() function is used to get essential information about your dataset, such as number of rows, columns, data types, etc:

In [29]:
df=df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ages     4 non-null      int64
 1   heights  4 non-null      int64
dtypes: int64(2)
memory usage: 192.0 bytes

In [ ]:
We can set our own index column by using the set_index() function:

In [42]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
}

In [43]:
import pandas as pd
df= pd.DataFrame(data)

In [44]:
df1=df.set_index('ages')
df1

      heights
ages
14        165
18        180
24        176
42        184

In [ ]:

Dropping a Column

In [45]:
import pandas as pd
df= pd.DataFrame(data)

In [46]:
df.drop('ages', axis=1, inplace=True)

In [47]:
df

   heights
0      165
1      180
2      176
3      184

In [ ]:
The inplace=True argument specifies that the change will be applied to our DataFrame, without the need to assign it to a new DataFrame variable.